modules/Tour/Controllers/AvailabilityController.php

select count(*) as aggregate from `category_time_slots` where `category_id` = 10 and `tour_id` = 69
---
    public function get_disabled_dates(Request $request, $tourId)
    {

      $tour = Tour::where('slug', $tourId)->first();

       if(!$tour)
       {
        $tour = Tour::find($tourId);
        }

        $bookings = Bookning_dates::where('tour_id', $tour->id)
            ->where('category_id', $tour->category_id)
            ->where('active', 1)
            ->get();
        $disabledDates = [];
        $bookings = json_decode($bookings, true);
        $dayCounts = [];

        foreach ($bookings as $booking) {
            $day = $booking['day'];
            if (isset($dayCounts[$day])) {
                $dayCounts[$day]++;
            } else {
                $dayCounts[$day] = 1;
            }
        }
        $result = [];
        foreach ($dayCounts as $day => $count) {
            $result[] = "Day: $day, Count: $count";
        }
        $time_slots = CategoryTimeSlot::where('category_id', $tour->category_id)
            ->where('tour_id', $tour->id)
            ->count();

select * from `category_time_slots` where `tour_id` = '69'
---
    public function time_slot(Request $request, $day, $tour_id)
    {
        $booking_dates = Bookning_dates::where('day', $day)->where('tour_id', $tour_id)->where('active', 1)->get();


        $time_slots = CategoryTimeSlot::where('tour_id', $tour_id)->get();

select * from `bravo_menus_translations` where `origin_id` = 49 and `locale` = 'en' limit 1
select * from `bravo_menus_translations` where `origin_id` = 62 and `locale` = 'en' limit 1
select * from `bravo_terms_translations` where `origin_id` = 167 and `locale` = 'en' limit 1
select * from `media_files` where `media_files`.`id` = 292 and `media_files`.`deleted_at` is null limit 1
---
    public function all_menus(Request $request, $tour_id)
    {
        $tour = Tour::find($tour_id);
        $menuIds = json_decode($tour->menu_id, true);

        if ($menuIds == null) {
            return response()->json([
                'all_menus' => [],
                'extra_terms' => [],
                'success' => false
            ]);
        } else {
            $menuIds = array_map('intval', $menuIds);
            $categories = MenuTour::whereIn('id', $menuIds)->get();
            $menusWithChildren = [];
            foreach ($categories as $category) {
                $category->menus = MenuTour::where('parent_id', $category->id)->get();
                $category_en = MenusTranslation::where('origin_id', $category->id)->where('locale', 'en')->first();
                $category->name_en = $category_en->name??'';
                $category->description_en = $category->description??'';
                foreach ($category->menus as $menu) {
                    $menu_en = MenusTranslation::where('origin_id', $menu->id)->where('locale', 'en')->first();
                    $menu->name_en = $menu_en->name;
                    $menu->description_en = $menu_en->description;
                    $menu->terms = Terms::where('menu_id', $menu->id)->get();
                    foreach ($menu->terms as $term) {
                        $term_en = TermsTranslation::where('origin_id', $term->id)->where('locale', 'en')->first();
                        $term->name_en = $term_en->name;
                        $term->description_en = $term_en->description;
                        $mediaFile = MediaFile::find($term->image_id);

select * from `menu_extras` where `menu_id` = 62
---
                            $term->image_path = "uploads/" . $mediaFile->file_path;
                        }
                    }
                    $menu->extra_terms = MenuExtras::where('menu_id', $menu->id)->get();

select * from `menu_extras` where `menu_id` in (62, 75)
---
            }
            $menu_tour = MenuTour::whereIn('parent_id', $menuIds)->get();
            $ids = $menu_tour->pluck('id');
            $extra_terms = MenuExtras::whereIn('menu_id', $ids)->get();