modules/Tour/Controllers/TourController.php

select * from `bravo_tour_category` where `status` = 'publish' and `bravo_tour_category`.`deleted_at` is null
---
        }
        $data = [
            'rows' => $list,
            'tour_category' => $this->tourCategoryClass::where('status', 'publish')->with(['translation'])->get()->toTree(),