modules/Tour/Models/Tour.php

    public function saveMeta(\Illuminate\Http\Request $request)
    {
        $meta = $this->tourMetaClass::where('tour_id', $this->id)->first();
---
select * from `bravo_tour_meta` where `tour_id` = 43 limit 1

    public function getNumberAvailableBooking($start_date)
    {
        $tourDate = $this->tourDateClass::where('target_id', $this->id)->where('start_date', $start_date)->where('active', 1)->first();
---
select * from `bravo_tour_dates` where `target_id` = 85 and `start_date` = '2024-05-30' and `active` = 1 limit 1

    public function isAvailableInRanges($start_date)
    {

        if ($this->default_state) {
            $notAvailableDates = $this->tourDateClass::query()->where([
                ['start_date', '>=', $start_date],
                ['end_date', '<=', $start_date],
                ['active', '0'],
                ['target_id', '=', $this->id],
            ])->count('id');
---
select count(`id`) as aggregate from `bravo_tour_dates` where (`start_date` >= '2024-05-30' and `end_date` <= '2024-05-30' and `active` = '0' and `target_id` = 85)

    public function search($request)
    {
        $model_Tour = parent::query()->select("bravo_tours.*");
        $model_Tour->where("bravo_tours.status", "publish");
        if (!empty($location_id = $request['location_id'] ?? "")) {
            $location = Location::where('id', $location_id)->where("status", "publish")->first();
            if (!empty($location)) {
                $model_Tour->join('bravo_locations', function ($join) use ($location) {
                    $join->on('bravo_locations.id', '=', 'bravo_tours.location_id')->where('bravo_locations._lft', '>=', $location->_lft)->where('bravo_locations._rgt', '<=', $location->_rgt);
                });
            }
        }
        if (!empty($price_range = $request['price_range'] ?? "")) {
            $pri_from = explode(";", $price_range)[0];
            $pri_to = explode(";", $price_range)[1];
            $raw_sql_min_max = "( (IFNULL(bravo_tours.sale_price,0) > 0 and bravo_tours.sale_price >= ? ) OR (IFNULL(bravo_tours.sale_price,0) <= 0 and bravo_tours.price >= ?) )
								AND ( (IFNULL(bravo_tours.sale_price,0) > 0 and bravo_tours.sale_price <= ? ) OR (IFNULL(bravo_tours.sale_price,0) <= 0 and bravo_tours.price <= ?) )";
            $model_Tour->WhereRaw($raw_sql_min_max, [
                $pri_from,
                $pri_from,
                $pri_to,
                $pri_to
            ]);
        }

        $category_ids = $request['cat_id'] ?? [];
        if (!is_array($category_ids)) $category_ids = [$category_ids];
        $category_ids = array_filter(array_values($category_ids));
        $list_cat = TourCategory::whereIn('id', $category_ids)->where("status", "publish")->get();
---
select * from `bravo_tour_category` where `id` in ('10') and `status` = 'publish' and `bravo_tour_category`.`deleted_at` is null