app/Helpers/AppHelper.php

select * from `core_settings` where `name` = 'tour_disable' limit 1
---
function setting_update_item($item, $val)
{

    $s = Settings::where('name', $item)->first();

select * from `core_pages` where `core_pages`.`id` = '' and `core_pages`.`deleted_at` is null limit 1
---
function get_page_url($page_id)
{
    $page = \Modules\Page\Models\Page::find($page_id);